{
  "website": {
    "title": "Mohamed Chnafy"
  },
  "nav": {
    "home": "Home",
    "about_me": "About",
    "skills": "Skills",
    "projects": "Projects",
    "career": "Career",
    "link": "Language"
  },
  "about_me": {
    "about_me": "About",
    "des": "Creative and meticulous Data Scientist with a proven track record of transforming data into actionable insights for strategic decision-making in the industrial sector. Demonstrated expertise in predictive analytics, data visualization, statistics, machine learning, and deep learning."
  },
  "skills": {
    "my_skills": "Skills"
  },
  "projects": {
    "my_projects": "Projects",
    "name_CD4": "Gaussian Mixture Models | Master's Project",
    "CD4": "Image denoising using Gaussian mixture models and classification algorithms (K-means, Expectation-Maximization). #Python #R #Matlab",
    "name_d3js": "BERT",
    "d3js": "Development of a conversational chatbot based on the BERT architecture | #Python #html #css #javascript #d3js",
    "name_Oil": "Matérn process",
    "Oil": "Simulation of a Matérn process to understand how grouped data manifest and how different parameters influence their spatial distribution. | #R #Python",
    "name_geoloc": "Prediction of soil mechanical parameters",
    "geoloc": "Implementation of an analysis and prediction algorithm | #Matlab #R #Python",
    "name_velov": "Velo'v data analysis",
    "velov": "Determining the evolution of bike-sharing in Lyon, descriptive analysis, statistics, and learning on this data. #kafka #spark"
  },
  "career": {
    "my_career": "Career",
    "main_field_of_study": "Main field of study",
    "Fondasol": "Data Scientist",
    "Fondasol_des": {
      "0": "Lead and supervise predictive modeling projects for soil mechanical parameters using machine learning techniques (Random Forest, GAM, neural networks, SVM) and geostatistics (Kriging, co-kriging) to improve analysis accuracy.",
      "1": "Data analysis and reporting: extract, clean, and format data using R and Python. Conduct descriptive analyses and develop interactive dashboards (R Shiny, Dash, Tableau, Power BI, Streamlit) to effectively communicate results.",
      "2": "Scientific and technical monitoring: In-depth investigation of scientific articles to extract the latest advances in machine learning, deep learning and geostatistics, and apply them to business challenges.",
      "3": "Modeling and prediction: Develop and deploy predictive algorithms (R, Python) to simulate soil mechanical parameters in real-time and optimize decision-making.",
      "4": "Multi-DBMS expertise: Design scalable web applications with PostgreSQL, administer large volumes of enterprise data with Oracle Database and implement complex analytical solutions with IBM Db2."
    },
    "Fondasol_date": "2020 - 2023",
    "Fondasol_job": "Fondasol",
    "Fondasol_course1": "Machine Learning, Deep Learning, R, Python, Time Series Analysis, Data Visualization, R Shiny, Dash, Tableau, Power BI, Streamlit",
    "LIRIS": "NLP Research Internship",
    "LIRIS_des": {
      "0": "Design and implementation of an AI-based conversational agent utilizing deep learning and natural language processing.",
      "1": "Synthesis of scientific publications.",
      "2": "Python implementation (primarily PyTorch and TensorFlow)."
    },
    "LIRIS_date": "2020",
    "LIRIS_job": "LIRIS (Laboratoire d'InfoRmatique en Image et Systèmes d'information)",
    "LIRIS_course1": "Natural Language Processing (NLP), Deep learning, Python, PyTorch, TensorFlow",
    "master2": "Master's Degree in Applied Mathematics, Data Science Specialization",
    "master2_des": {
      "0": "I chose a specialization in Data Science shared between Mathematics and Computer Science section of the University Lyon 1."
    },
    "master2_date": "2019 - 2020",
    "master2_job": "Claude Bernard University Lyon 1",
    "master2_course1": "Statistical methods and Regression Models, Probabilistic Graphical Models, Graph Complexity and Combinatory, Data Visualization, Cloud Computing, Data Mining, Big Data Analytics, Machine learning",
    "master1": "Master's Degree (First Year) in Applied Mathematics and Statistics",
    "master1_des": {
      "0": "Training in applied mathematics and statistics"
    },
    "master1_date": "2018 - 2019",
    "master1_job": "Claude Bernard University Lyon 1",
    "master1_course1": "Probability Theory, Statistics, Time Series Analysis, Numerical Analysis and Optimization, Signal Processing",
    "licence": "Bachelor's Degree in General Mathematics",
    "licence_des": {
      "0": "Solid foundation in mathematics, probability, and statistics"
    },
    "licence_date": "2016 - 2018",
    "licence_job": "University of Avignon",
    "licence_course1": "Mathematics, Probability Theory, Statistics"
  },
  "link": {
    "link": "Language",
    "view": "views",
    "french": {"last_name":"French", "desc": "Native"},
    "english": {"last_name": "English", "desc": "Professional"},
    "arabic": {"last_name":"Arabic", "desc": "Native"},
    "spanish": {"last_name": "Spanish", "desc": "Limited"}
  }
}